### `Data Exploration and Cleaning` (If needed)

In [1]:
# Importing libreries
import pandas as pd

In [33]:
# Loading the txt data.
# df = pd.read_csv('../Dataset/train_FD003.txt', sep='\s', header=None)
# df2 = pd.read_csv('../Dataset/test_FD003.txt', sep='\s', header=None)

In [61]:
df = pd.read_csv('./training_data.csv', index_col='idx')
df2 = pd.read_csv('./testing_data.csv', index_col='idx')

In [62]:
print('Training Data :', len(df.value_counts()))
print('Testing Data :', len(df2.value_counts()))

Training Data : 24720
Testing Data : 12231

In [63]:
df.head()

,unit_no,time_cycles,op_set1,op_set2,op_set3,sem_1,sem_2,sem_3,sem_4,sem_5,...,sem_12,sem_13,sem_14,sem_15,sem_16,sem_17,sem_18,sem_19,sem_20,sem_21
idx,,,,,,,,,,,,,,,,,,,,,
0,1,1,-0.0005,0.0004,100,518.67,642.36,1583.23,1396.84,14.62,...,522.31,2388.01,8145.32,8.4246,0.03,391,2388,100,39.11,23.3537
1,1,2,0.0008,-0.0003,100,518.67,642.50,1584.69,1396.89,14.62,...,522.42,2388.03,8152.85,8.4403,0.03,392,2388,100,38.99,23.4491
2,1,3,-0.0014,-0.0002,100,518.67,642.18,1582.35,1405.61,14.62,...,522.03,2388.00,8150.17,8.3901,0.03,391,2388,100,38.85,23.3669
3,1,4,-0.0020,0.0001,100,518.67,642.92,1585.61,1392.27,14.62,...,522.49,2388.08,8146.56,8.3878,0.03,392,2388,100,38.96,23.2951
4,1,5,0.0016,0.0000,100,518.67,641.68,1588.63,1397.65,14.62,...,522.58,2388.03,8147.80,8.3869,0.03,392,2388,100,39.14,23.4583

In [64]:
df2.head()

,unit_no,time_cycles,op_set1,op_set2,op_set3,sem_1,sem_2,sem_3,sem_4,sem_5,...,sem_12,sem_13,sem_14,sem_15,sem_16,sem_17,sem_18,sem_19,sem_20,sem_21
idx,,,,,,,,,,,,,,,,,,,,,
0,1,1,-0.0017,-0.0004,100,518.67,641.94,1581.93,1396.93,14.62,...,521.89,2387.94,8133.48,8.3760,0.03,391,2388,100,39.07,23.4468
1,1,2,0.0006,-0.0002,100,518.67,642.02,1584.86,1398.90,14.62,...,521.85,2388.01,8137.44,8.4062,0.03,391,2388,100,39.04,23.4807
2,1,3,0.0014,-0.0003,100,518.67,641.68,1581.78,1391.92,14.62,...,522.10,2387.94,8138.25,8.3553,0.03,391,2388,100,39.10,23.4244
3,1,4,0.0027,0.0001,100,518.67,642.20,1584.53,1395.34,14.62,...,522.45,2387.96,8137.07,8.3709,0.03,392,2388,100,38.97,23.4782
4,1,5,-0.0001,0.0001,100,518.67,642.46,1589.03,1395.86,14.62,...,521.91,2387.97,8134.20,8.4146,0.03,391,2388,100,39.09,23.3950

### `Data Cleaning Steps`
- Handle missing values
- Fill 0 or Nulls with Median
- Add RUL columns (max cycles - current cycle)

In [86]:
# Data Cleaning for Training Data.
# Checking for NUll values.
df.count()

unit_no        24720
time_cycles    24720
op_set1        24720
op_set2        24720
op_set3        24720
sem_1          24720
sem_2          24720
sem_3          24720
sem_4          24720
sem_5          24720
sem_6          24720
sem_7          24720
sem_8          24720
sem_9          24720
sem_10         24720
sem_11         24720
sem_12         24720
sem_13         24720
sem_14         24720
sem_15         24720
sem_16         24720
sem_17         24720
sem_18         24720
sem_19         24720
sem_20         24720
sem_21         24720
dtype: int64

In [67]:
df.columns

Index(['unit_no', 'time_cycles', 'op_set1', 'op_set2', 'op_set3', 'sem_1',
       'sem_2', 'sem_3', 'sem_4', 'sem_5', 'sem_6', 'sem_7', 'sem_8', 'sem_9',
       'sem_10', 'sem_11', 'sem_12', 'sem_13', 'sem_14', 'sem_15', 'sem_16',
       'sem_17', 'sem_18', 'sem_19', 'sem_20', 'sem_21'],
      dtype='object')

In [98]:
df.all()
# Okay, So in op_set1 and op_set2 contains 0s.....

unit_no        True
time_cycles    True
op_set1        True
op_set2        True
op_set3        True
sem_1          True
sem_2          True
sem_3          True
sem_4          True
sem_5          True
sem_6          True
sem_7          True
sem_8          True
sem_9          True
sem_10         True
sem_11         True
sem_12         True
sem_13         True
sem_14         True
sem_15         True
sem_16         True
sem_17         True
sem_18         True
sem_19         True
sem_20         True
sem_21         True
dtype: bool

In [87]:
# Handling 0s with mean values.
df['op_set1']=df['op_set1'].replace(0,df['op_set1'].mean())
for indx, zero in enumerate(df['op_set1']):
    if zero == 0:
        print(indx)

In [88]:
df['op_set2']=df['op_set2'].replace(0,df['op_set2'].mean())
for indx, zero in enumerate(df['op_set1']):
    if zero == 0:
        print(indx)

In [89]:
df.all()

unit_no        True
time_cycles    True
op_set1        True
op_set2        True
op_set3        True
sem_1          True
sem_2          True
sem_3          True
sem_4          True
sem_5          True
sem_6          True
sem_7          True
sem_8          True
sem_9          True
sem_10         True
sem_11         True
sem_12         True
sem_13         True
sem_14         True
sem_15         True
sem_16         True
sem_17         True
sem_18         True
sem_19         True
sem_20         True
sem_21         True
dtype: bool

In [90]:
# Data Cleaning for Testing Data.
# Checking for NUll values.
df2.count()

unit_no        12231
time_cycles    12231
op_set1        12231
op_set2        12231
op_set3        12231
sem_1          12231
sem_2          12231
sem_3          12231
sem_4          12231
sem_5          12231
sem_6          12231
sem_7          12231
sem_8          12231
sem_9          12231
sem_10         12231
sem_11         12231
sem_12         12231
sem_13         12231
sem_14         12231
sem_15         12231
sem_16         12231
sem_17         12231
sem_18         12231
sem_19         12231
sem_20         12231
sem_21         12231
dtype: int64

In [91]:
df2.columns

Index(['unit_no', 'time_cycles', 'op_set1', 'op_set2', 'op_set3', 'sem_1',
       'sem_2', 'sem_3', 'sem_4', 'sem_5', 'sem_6', 'sem_7', 'sem_8', 'sem_9',
       'sem_10', 'sem_11', 'sem_12', 'sem_13', 'sem_14', 'sem_15', 'sem_16',
       'sem_17', 'sem_18', 'sem_19', 'sem_20', 'sem_21'],
      dtype='object')

In [93]:
df2.all()
# Here we go, we got op_set1 and op_set2 with 0s.....F***k..

unit_no         True
time_cycles     True
op_set1        False
op_set2        False
op_set3         True
sem_1           True
sem_2           True
sem_3           True
sem_4           True
sem_5           True
sem_6           True
sem_7           True
sem_8           True
sem_9           True
sem_10          True
sem_11          True
sem_12          True
sem_13          True
sem_14          True
sem_15          True
sem_16          True
sem_17          True
sem_18          True
sem_19          True
sem_20          True
sem_21          True
dtype: bool

In [94]:
# Handling 0s with mean values.
df2['op_set1']=df2['op_set1'].replace(0,df2['op_set1'].mean())
for indx, zero in enumerate(df2['op_set1']):
    if zero == 0:
        print(indx)

In [96]:
df2['op_set2']=df2['op_set2'].replace(0,df2['op_set2'].mean())
for indx, zero in enumerate(df2['op_set2']):
    if zero == 0:
        print(indx)

In [97]:
df2.all()

unit_no        True
time_cycles    True
op_set1        True
op_set2        True
op_set3        True
sem_1          True
sem_2          True
sem_3          True
sem_4          True
sem_5          True
sem_6          True
sem_7          True
sem_8          True
sem_9          True
sem_10         True
sem_11         True
sem_12         True
sem_13         True
sem_14         True
sem_15         True
sem_16         True
sem_17         True
sem_18         True
sem_19         True
sem_20         True
sem_21         True
dtype: bool

In [99]:
df.columns

Index(['unit_no', 'time_cycles', 'op_set1', 'op_set2', 'op_set3', 'sem_1',
       'sem_2', 'sem_3', 'sem_4', 'sem_5', 'sem_6', 'sem_7', 'sem_8', 'sem_9',
       'sem_10', 'sem_11', 'sem_12', 'sem_13', 'sem_14', 'sem_15', 'sem_16',
       'sem_17', 'sem_18', 'sem_19', 'sem_20', 'sem_21'],
      dtype='object')

In [121]:
# Adding RUL to both dfs....
df['RUL'] = df['time_cycles'].max() - df['time_cycles']
df2['RUL'] = df2['time_cycles'].max() - df2['time_cycles']

In [120]:
# Okay, So RUL is perfect...
# for indx, zero in enumerate(df['RUL']):
#     if zero == 500:
#         print(indx)

In [122]:
df.RUL

idx
0        524
1        523
2        522
3        521
4        520
        ...
24715    377
24716    376
24717    375
24718    374
24719    373
Name: RUL, Length: 24720, dtype: int64

In [123]:
df2.RUL

idx
0        166
1        165
2        164
3        163
4        162
        ...
12226     24
12227     23
12228     22
12229     21
12230     20
Name: RUL, Length: 12231, dtype: int64

In [125]:
# Moving data for data visualization.
df.to_csv('../data_visualization/cleaned_training.csv')
df2.to_csv('../data_visualization/cleaned_testing.csv')

In [126]:
# That's it motherf***ks for here.